Revit 2027 API
BuiltInFailures.RoomFailures.RoomBelowCompHeight Property
 [Room] Volume is being calculated above the Upper Limit of this [Room]. Change the Upper Limit and Offset or change the height of volume calculations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomBelowCompHeight { get; }
Public Shared ReadOnly Property RoomBelowCompHeight As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomBelowCompHeight {
	FailureDefinitionId^ get ();
}
static member RoomBelowCompHeight : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace